huhdanu/Device_Driver/Lib/func_s32k1xx.c
/* comment detail */

#include		"func_s32k1xx.h"				// for use prototype
#include 	"s32k1xx.h"						// for use address define
#include 	<string.h>




/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				SET to set 1
				CLEAR to set 0
**********************************************************/
void f_SetClearBit(uint32_t* nAddress, uint8_t nPosition, uint8_t cSel){
	(cSel == 1)?(*nAddress = (*nAddress)|(1<<nPosition)) : (*nAddress = (*nAddress)&(~(1<<nPosition)));
}
/* --------------------------------------------------------------------------------------------------------------- */



/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				SET to set 1
				CLEAR to set 0
**********************************************************/
void f_SetMultiBit(uint32_t* nAddress, uint8_t nPos, uint32_t nValue, uint32_t nMask){
		*nAddress &= (uint32_t)~(nMask<<nPos);					// clear 8 9 10 at MUX
		*nAddress |= nValue<<nPos;									// set value bit for 8 9 10 at MUX
}
/* --------------------------------------------------------------------------------------------------------------- */




/* --------------------------------------------------------------------------------------------------------------- */
	/********************* STEP TO FOLLOW ********************************** 
					1. Address PDDR of GPIO port					
					2. Address PTOR of GPIO port
	***********************************************************************/
void f_TogglePin(uint32_t* GPIOx_PDDR, uint32_t* GPIOx_PTOR){
	// set GPIO as output
	f_SetClearBit(GPIOx_PDDR,15,HIGH);
	// set for toggle status in PIN of GPIO port
	f_SetClearBit(GPIOx_PTOR,15,HIGH);
}
/* --------------------------------------------------------------------------------------------------------------- */




/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************************** 
 *          Select port have pin want to setup
 *          Select pin in port
 *          Choose setup of pin is INPUT or OUTPUT
************************************************************************/
void f_PinMode(uint8_t PORTx, uint8_t PinX, uint8_t setIO){
	if(PORTx == 0x0){	//portA	-	0b000
		/* address of PIN in PORT */
		uint32_t *add_PORT_PCRn = (uint32_t*)(PORTA_BASE|PinX*4);
		/* set clock for PORT A to use peripheral */
		f_SetClearBit(&PCC->mPORTA,30,HIGH);
		/* set mux to select GPIO for pin */
		f_SetMultiBit(add_PORT_PCRn,8u,0x1,MASK_3BIT);
		/* address of PDDR of GPIO */
		/* set as output or input dependent on status */
		f_SetClearBit(&GPIOA->PDDR,PinX,setIO);
	}
	else if(PORTx == 0x1){	//portB	-	0b001
		/* address PORT_PCR pin of PORTD */
		uint32_t *add_PORT_PCRn = (uint32_t*)(PORTB_BASE|PinX*4);
		/* set clock for PORT B to use peripheral */
		f_SetClearBit(&PCC->mPORTB,30,HIGH);
		/* set mux to select GPIO for pin */
		f_SetMultiBit(add_PORT_PCRn,8u,0x1,MASK_3BIT);
		/* address of PDDR of GPIO */
		/* set as output or input dependent on status */
		f_SetClearBit(&GPIOB->PDDR,PinX,setIO);
	}
	else if(PORTx == 0x2){	//portC	-	0b010
		/* address PCC_PORTD and PORT_PCR pin of PORTD */
		uint32_t *add_PORT_PCRn = (uint32_t*)(PORTC_BASE|PinX*4);
		/* set clock for PORT C to use peripheral */
		f_SetClearBit(&PCC->mPORTC,30,HIGH);
		/* set mux to select GPIO for pin */
		f_SetMultiBit(add_PORT_PCRn,8u,0x1,MASK_3BIT);
		/* set as output or input dependent on status */
		f_SetClearBit(&GPIOC->PDDR,PinX,setIO);
	}
	else if(PORTx == 0x3){	//portD	-	0b011
		/* address PORT_PCR pin of PORTD */
		uint32_t *add_PORT_PCRn = (uint32_t*)(PORTD_BASE|PinX*4);
		/* set clock for PORT D to use peripheral */
		f_SetClearBit(&PCC->mPORTD,30,HIGH);
		/* set mux to select GPIO for pin */
		f_SetMultiBit(add_PORT_PCRn,8u,0x1,MASK_3BIT*4);
		/* set as output or input dependent on status */
		f_SetClearBit(&GPIOD->PDDR,PinX,setIO);
	}
	else if(PORTx == 0x4){	//portE	-	0b100
		/* address PORT_PCR pin of PORTD */
		uint32_t *add_PORT_PCRn = (uint32_t*)(PORTE_BASE|PinX*4);
		/* set clock for PORT E to use peripheral */
		f_SetClearBit(&PCC->mPORTE,30,HIGH);
		/* set mux to select GPIO for pin */
		f_SetMultiBit(add_PORT_PCRn,8u,0x1,MASK_3BIT);
		/* set as output or input dependent on status */
		f_SetClearBit(&GPIOE->PDDR,PinX,setIO);

	}
}
/* --------------------------------------------------------------------------------------------------------------- */



/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************************** 
 *          Select PORT have PIN want to set up
 *          Select PIN in port
 *          Choose status LOW or HIGH for PIN
************************************************************************/
void f_DigitalWrite(uint8_t PORTx, uint8_t PinX, uint8_t status){
	if(PORTx == 0x0){	//portA	-	0b000
		/* set status of pin output LOW or HIGH */
		f_SetClearBit(&GPIOA->PDOR,PinX,status);
	}
	else if(PORTx == 0x1){	//portB	-	0b001
		/* set status of pin output LOW or HIGH */
		f_SetClearBit(&GPIOB->PDOR,PinX,status);
	}
	else if(PORTx == 0x2){	//portC	-	0b010
		/* set status of pin output LOW or HIGH */
		f_SetClearBit(&GPIOC->PDOR,PinX ,status);
	}
	else if(PORTx == 0x3){	//portD	-	0b011
		/* set status of pin output LOW or HIGH */
		f_SetClearBit(&GPIOD->PDOR,PinX,status);
	}
	else if(PORTx == 0x4){	//portE	-	0b100
		/* set status of pin output LOW or HIGH */
		f_SetClearBit(&GPIOE->PDOR,PinX,status);
	}
}
/* --------------------------------------------------------------------------------------------------------------- */



/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************************** 
 *          Select PORT have PIN want to set up
 *          Select PIN in port
 *          Choose status LOW or HIGH for PIN
************************************************************************/
/* uint8_t f_DigitalRead(uint8_t PORTx, uint8_t PinX){
	if(PORTx == 0x0){	//portA	-	0b000
		// set status of pin output LOW or HIGH
		return ((GPIOA->PDIR)&(1<<PinX));
	}
	else if(PORTx == 0x1){	//portB	-	0b001
		// set status of pin output LOW or HIGH
		return ((GPIOB->PDIR)&(1<<PinX));
	}
	else if(PORTx == 0x2){	//portC	-	0b010
		// set status of pin output LOW or HIGH
		return ((GPIOC->PDIR)&(1<<PinX));
	}
	else if(PORTx == 0x3){	//portD	-	0b011
		// set status of pin output LOW or HIGH
		return ((GPIOD->PDIR)&(1<<PinX));
	}
	else if(PORTx == 0x4){	//portE	-	0b100
		// set status of pin output LOW or HIGH
		return ((GPIOE->PDIR)&(1<<PinX));
	}
}  */
/* --------------------------------------------------------------------------------------------------------------- */




/* --------------------------------------------------------------------------------------------------------------- */
/* use to set up interrupt in PIN of PORT */
void f_GPIOPinInterrupt(uint8_t PORTx, uint8_t PinX, uint8_t modeInterrupt){
	if(PORTx == 0x0){				// for port A
		uint32_t* add_PORT_PCRn = (uint32_t*)(PORTA_BASE|PinX*4);
		// set ISF of PIN
		f_SetClearBit(add_PORT_PCRn,24,HIGH);
		// select mode for interrupt
		f_SetMultiBit(add_PORT_PCRn,16u,modeInterrupt,MASK_4BIT);
	}
	else if(PORTx == 0x1){			// for port B
		uint32_t* add_PORT_PCRn = (uint32_t*)(PORTB_BASE|PinX*4);
		// set ISF of PIN
		f_SetClearBit(add_PORT_PCRn,24,HIGH);
		// select mode for interrupt
		f_SetMultiBit(add_PORT_PCRn,16u,modeInterrupt,MASK_4BIT);
	}
	else if(PORTx == 0x2){			// for port C
		uint32_t* add_PORT_PCRn = (uint32_t*)(PORTC_BASE|PinX*4);
		// set ISF of PIN
		f_SetClearBit(add_PORT_PCRn,24,HIGH);
		// select mode for interrupt
		f_SetMultiBit(add_PORT_PCRn,16u,modeInterrupt,MASK_4BIT);
	}
	else if(PORTx == 0x3){			// for port D
		uint32_t* add_PORT_PCRn = (uint32_t*)(PORTD_BASE|PinX*4);
		// set ISF of PIN
		f_SetClearBit(add_PORT_PCRn,24,HIGH);
		// select mode for interrupt
		f_SetMultiBit(add_PORT_PCRn,16u,modeInterrupt,MASK_4BIT);
	}
	else if(PORTx == 0x4){			// for port E
		uint32_t* add_PORT_PCRn = (uint32_t*)(PORTE_BASE|PinX*4);
		// set ISF of PIN
		f_SetClearBit(add_PORT_PCRn,24,HIGH);
		// select mode for interrupt
		f_SetMultiBit(add_PORT_PCRn,16u,modeInterrupt,MASK_4BIT);
	}
}
/* --------------------------------------------------------------------------------------------------------------- */




/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				enter number of Nested vestor
**********************************************************/
void f_SetNVIC(uint8_t NVICID){
	uint8_t SelRegister = (NVICID/32);					/* to select ISER Interrupt Select Enable Register */
	uint8_t SelLocationBit = (NVICID%32);				/* select location of bit in above register */
	uint32_t* NVICset = ((uint32_t*)(NVIC_BASE|SelRegister*4));			/* get value NVIC at ISER */
	*NVICset |=  1<<SelLocationBit;
}
/* --------------------------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------------------------- */
// LPUART0:(rx-tx) PORTA pin2-3, PORTB pin0-1, PORTC pin2-3
// LPUART1:(rx-tx) PORTC pin6-7, PORTC pin8-9 --> use PTC6 and PTC7 to use USB support
// LPUART2:(rx-tx)
/********************* STEP TO FOLLOW ********************* 
				enter number of baudrate
**********************************************************/
void f_InitLPUART1(uint32_t baudrate){
	uint32_t *add_PORT_PCR6 = (uint32_t*)(PORTC_BASE|6*4);  
	uint32_t *add_PORT_PCR7 = (uint32_t*)(PORTC_BASE|7*4);
	uint32_t SBRValue = (uint32_t)(CORE_CLOCK/(baudrate*16));			// calculate value to input SBR
	
