huhdanu/Device_Driver/Lib/func_s32k1xx.c
	// config clock for UART 48Mhz
	f_SetMultiBit(&SCG->FIRCDIV,8u,0x1,MASK_3BIT);
	
	/* step 1: setting Tx/Rx pin */
	// enable clock for PORT C
	f_SetClearBit(&PCC->mPORTC,30,HIGH);
	// set pin 6 PORTC as UART RX
	
	f_SetMultiBit(add_PORT_PCR6,8u,0x2,MASK_3BIT);
	// set pin 7 PORTC as UART TX
	
	f_SetMultiBit(add_PORT_PCR7,8u,0x2,MASK_3BIT);

	/* step 2: Select source LPUART */
	// select clock for UART use FIRCDIV2 48Mhz
	f_SetMultiBit(&PCC->mLPUART1,24,0x3,MASK_3BIT);		
	// select source LPUART
	f_SetClearBit(&PCC->mLPUART1,30,HIGH);

	/* step 3: setting baud rate */
	// set modulo divide rate
	
	f_SetMultiBit(&LPUART1->BAUD,0u,SBRValue,0x3FF);							// 0x3FF to mask 12 bit 
	// set Oversampling default div 15+1, maybe not set

	/* step 4: setting frame */
	// set one bit stop
	f_SetClearBit(&PCC->mLPUART1,13,LOW);
	// set 8 BIT for data number
	f_SetClearBit(&LPUART1->CTRL,4,LOW);		
	// disable PARITY bit for frame data
	f_SetClearBit(&LPUART1->CTRL,0,LOW);

	/* step 5: enable Tx or Rx */
	// Tx enable
	f_SetClearBit(&LPUART1->CTRL,19,HIGH);
	// Rx enable
	f_SetClearBit(&LPUART1->CTRL,18,HIGH);
}
/* --------------------------------------------------------------------------------------------------------------- */



/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				enter number baurate
**********************************************************/
void f_InterruptLPUART1(uint32_t baudrate){
	uint32_t *add_PORT_PCR6 = (uint32_t*)(PORTC_BASE|6*4);
	uint32_t *add_PORT_PCR7 = (uint32_t*)(PORTC_BASE|7*4);
	uint32_t SBRValue = (uint32_t)(CORE_CLOCK/(baudrate*16));			// calculate value to input SBR
	
	// config clock for UART 48Mhz
	f_SetMultiBit(&SCG->FIRCDIV,8u,0x1,MASK_3BIT);
	
	/* step 1: setting Tx/Rx pin */
	// enable clock for PORT C
	f_SetClearBit(&PCC->mPORTC,30,HIGH);
	// set pin 6 PORTC as UART RX
	
	f_SetMultiBit(add_PORT_PCR6,8u,0x2,MASK_3BIT);
	// set pin 7 PORTC as UART TX
	
	f_SetMultiBit(add_PORT_PCR7,8u,0x2,MASK_3BIT);

	/* step 2: Select source LPUART */
	// select clock for UART use FIRCDIV2 48Mhz
	f_SetMultiBit(&PCC->mLPUART1,24,0x3,MASK_3BIT);		
	// select source LPUART
	f_SetClearBit(&PCC->mLPUART1,30,HIGH);

	/* step 3: setting baud rate */
	// set modulo divide rate
	
	f_SetMultiBit(&LPUART1->BAUD,0u,SBRValue,0x3FF);							// 0x3FF to mask 10 bit 
	// set Oversampling default div 15+1, maybe not set

	/* step 4: setting frame */
	// set one bit stop
	f_SetClearBit(&PCC->mLPUART1,13,LOW);
	// set 8 BIT for data number
	f_SetClearBit(&LPUART1->CTRL,4,LOW);		
	// disable PARITY bit for frame data
	f_SetClearBit(&LPUART1->CTRL,0,LOW);

	/* config for interrupt */
	//f_SetClearBit(&LPUART1->CTRL,23u,HIGH);						// set flag for Tx
	f_SetClearBit(&LPUART1->CTRL,21u,HIGH);						// set flag for Rx

	/* step 5: enable Tx or Rx */
	// Tx enable
	f_SetClearBit(&LPUART1->CTRL,19,HIGH);
	// Rx enable
	f_SetClearBit(&LPUART1->CTRL,18,HIGH);
}
/* --------------------------------------------------------------------------------------------------------------- */



/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				enter number baudrate
**********************************************************/
void f_InterruptLPUART2(uint32_t baudrate){
	
	uint32_t *add_PORT_PCR6 = (uint32_t*)(PORTD_BASE|6*4);				// use pin D6 as RX
	uint32_t *add_PORT_PCR7 = (uint32_t*)(PORTD_BASE|7*4);				// use pin D7 as TX
	uint32_t SBRValue = (uint32_t)(CORE_CLOCK/(baudrate*16));			// calculate value to input SBR
	
	// config clock for UART 48Mhz
	f_SetMultiBit(&SCG->FIRCDIV,8u,0x1,MASK_3BIT);
	
	/* step 1: setting Tx/Rx pin */
	// enable clock for PORT B
	f_SetClearBit(&PCC->mPORTD,30,HIGH);
	
	// set pin 6 PORTC as UART RX
	f_SetMultiBit(add_PORT_PCR6,8u,0x2,MASK_3BIT);
	// set pin 7 PORTC as UART TX
	f_SetMultiBit(add_PORT_PCR7,8u,0x2,MASK_3BIT);

	/* step 2: Select source LPUART */
	// select clock for UART use FIRCDIV2 48Mhz
	f_SetMultiBit(&PCC->mLPUART2,24,0x3,MASK_3BIT);		
	// select source LPUART
	f_SetClearBit(&PCC->mLPUART2,30,HIGH);

	/* step 3: setting baud rate */
	// set modulo divide rate
	
	f_SetMultiBit(&LPUART2->BAUD,0u,SBRValue,0x3FF);						// 0x3FF to mask 10 bit 
	// set Oversampling default div 15+1, maybe not set

	/* step 4: setting frame */
	// set one bit stop
	f_SetClearBit(&PCC->mLPUART2,13,LOW);
	// set 8 BIT for data number
	f_SetClearBit(&LPUART2->CTRL,4,LOW);		
	// disable PARITY bit for frame data
	f_SetClearBit(&LPUART2->CTRL,0,LOW);

	/* config for interrupt */
	//f_SetClearBit(&LPUART1->CTRL,23u,HIGH);									// set flag for Tx
	f_SetClearBit(&LPUART2->CTRL,21u,HIGH);									// set flag for Rx

	/* step 5: enable Tx or Rx */
	// Tx enable
	f_SetClearBit(&LPUART2->CTRL,19,HIGH);
	// Rx enable
	f_SetClearBit(&LPUART2->CTRL,18,HIGH);
}
/* --------------------------------------------------------------------------------------------------------------- */



/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************************** 
 *          	Insert time interrupt to process handler(Tick)
************************************************************************/
void f_SysTickInit(uint32_t ValueInterrupt){
	/* calculate value to set for Reload Value Register */
	uint32_t ValueSet = (CORE_CLOCK/ValueInterrupt - 1);
	uint32_t ValueSet_save = ValueSet;
	(ValueSet>=LIMITCOUNT24BIT)?(ValueSet=LIMITCOUNT24BIT):(ValueSet = ValueSet_save);
	// disable Clock
	f_SetClearBit(&SYSTICK->CSR,0,LOW);
	// set reload max
	f_SetMultiBit(&SYSTICK->RVR,0,ValueSet,0xFFFFFFFF);
	// enable clock
	f_SetMultiBit(&SYSTICK->CSR,0,0x5,MASK_3BIT);					// 0x5 for disable interrupt
}
/* --------------------------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				use to delay each 1ms
**********************************************************/
void f_delayMillis(void){
	f_SetMultiBit(&SYSTICK->RVR,0,(CORE_CLOCK/1000)-1,0xFFFFFFFF);		// 1ms
	while((SYSTICK->CSR & (1<<16)) == 0);			// wait count flag turn to 1
}
/* --------------------------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				enter number delay ms
**********************************************************/
void f_delayMs(uint32_t t){
	for(;t>0;t--){
		f_delayMillis();
	}
}
/* --------------------------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				enter symbol to sent by UART
**********************************************************/
void f_SentSymbol(char symbol){
	while(TDRE_LPUART2 == 0);							// wait to TDRE empty
	LPUART2->DATA = symbol;
}
/* --------------------------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				enter string to sent by UART
**********************************************************/
void f_SentStringUART(char* string){
	while(*string != '\0'){
		f_SentSymbol(*string);
		string++;
	}
}
/* --------------------------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				enter symbol to sent by SPI
**********************************************************/
void f_SentSymbolSPI(char symbol){
	while(((LPSPI0->SR)&1) == 0);
	LPSPI0->TDR = symbol;
}


/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				enter symbol sent to MAX7219
**********************************************************/
void f_SentMAX7219(short symbol){
	while(((LPSPI0->SR)&1) == 0);
	LPSPI0->TDR = (uint32_t)symbol;
}
/* --------------------------------------------------------------------------------------------------------------- */


//extern char g_RCF;
///* --------------------------------------------------------------------------------------------------------------- */
///********************* STEP TO FOLLOW ********************* 
//				enter string to sent by SPI to slave
//**********************************************************/
//void f_SentStringSPI(char* string){
//	while(*string != '\0'){
//		f_SentSymbolSPI(*string);
//		g_RCF = 1;								// enable Receive complete flag
//		while(g_RCF);							// receive complete
//		string++;
//	}
//	f_SentSymbolSPI(*string);
//}
///* --------------------------------------------------------------------------------------------------------------- */



/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				enter 2 string to compare
**********************************************************/
uint8_t f_CompareString(char* string1, char* string2){
	if(strlen(string1) != strlen(string2)) return 0;				// compare length
	else{
		while((*string1!='\0') && (*string2!='\0')){				// check each components in string
			if(*string1 == *string2);
			else return 0;
			string1++;
			string2++;
		}
		return 1;
	}
}
/* --------------------------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				init LPIT
**********************************************************/
void f_InitLPIT(void){
//	// config clock for timer select SIRCDIV2
//	f_SetMultiBit((uint32_t*)(SCG_BASE|0x204),8u,0b100,MASK_3BIT);			// set SIRDCDIV2_CLK div8 equal 1Mhz
	
	/* step 1: setting cloking */
	f_SetMultiBit((uint32_t*)(PCC_BASE|0xDC),24u,0x7,MASK_3BIT);			// use LPO_CLK		
	f_SetClearBit((uint32_t*)(PCC_BASE|0xDC),30u,HIGH);						// enable clock

	/* step 2: LPIT initialization */
	f_SetClearBit(&LPIT->MCR,0u, HIGH);												// enable clock for TIMER
	f_SetClearBit(&LPIT->MCR,3u, LOW);												// stop timer channel in Debug mode

	/* step 3: Config channel */
	f_SetMultiBit(&LPIT->TCTRL0,2u,0x0,MASK_2BIT);								// select 32 bit, auto reload when overflow

	/* set value */
	f_SetMultiBit(&LPIT->TVAL0,0u,128000u,0xffffffff);							// 1s count down

	/* step 4: Timer channel */
	f_SetClearBit(&LPIT->TCTRL0,0u, HIGH);											// enable TIMER channel
	
	/* step 5: Get timer Counter value */

