huhdanu/Device_Driver/Lib/func_s32k1xx.c
}
/* --------------------------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				enter number ms want to be interrupt
**********************************************************/
void f_InterruptLPIT(uint16_t millisecond){
	
	uint32_t valueSet = (uint32_t)((millisecond/1000)*LPO128_CLK);
	
	/* step 1: setting cloking */
	f_SetMultiBit(&PCC->mLPIT,24u,0x7,MASK_3BIT);									// use LPO_CLK	
	f_SetClearBit(&PCC->mLPIT,30u,HIGH);												// enable clock

	/* step 2: LPIT initialization */
	f_SetClearBit(&LPIT->MCR,0u, HIGH);													// enable clock for TIMER
	f_SetClearBit(&LPIT->MCR,3u, LOW);													// stop timer channel in Debug mode

	/* enable channel interrupt */
	f_SetClearBit(&LPIT->MIER,0u,HIGH);													// enable interrupt channel

	/* step 3: Config channel */
	f_SetMultiBit(&LPIT->TCTRL0,2u,0x0,MASK_2BIT);									// select 32 bit, auto reload when overflow

	/* set value */
	
	f_SetMultiBit(&LPIT->TVAL0,0u,valueSet-1,0xffffffff);							// 1s count down

	/* step 4: Timer channel */
	f_SetClearBit(&LPIT->TCTRL0,0u, HIGH);												// enable TIMER channel
	
	/* step 5: Get timer Counter value */

}
/* --------------------------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
				select channel use ADC
				select number channel in that ADC
				select resolution
**********************************************************/
void f_AnalogSetup(uint8_t channel_ADC, uint8_t channel_num,uint8_t resolution){
	if (channel_ADC == 0){														// ADC0
		// config clock for timer select SIRCDIV2
		f_SetMultiBit((uint32_t*)(SCG_BASE|0x204),8u,0x1,MASK_3BIT);			// set SIRDCDIV2_CLK div1 equal 8Mhz

		/* step 1: setting PCC */
		f_SetMultiBit(&PCC->mADC0,24u,0x2,MASK_3BIT);								// use SIRCDIV2_CLK
		f_SetClearBit(&PCC->mADC0,30u,HIGH);											// enable clock
		/* step 2: config ADC clock */		// in CFG1 register
		f_SetMultiBit((uint32_t*)(ADC0_BASE|0x40),0u,0x0,MASK_2BIT);			// input ALTCLK_1
		f_SetMultiBit((uint32_t*)(ADC0_BASE|0x40),5u,0x0,MASK_2BIT);			// CLK divide select
		
		/* step 3: config scale */			
		f_SetClearBit((uint32_t*)(ADC0_BASE|0),6u,HIGH);							// use interrupt
		
		f_SetMultiBit((uint32_t*)(ADC0_BASE|0x40),2u,resolution,MASK_2BIT);	// set resolution
		f_SetMultiBit((uint32_t*)(ADC0_BASE|0x44),0u,13u-1u,MASK_3BIT);		// set sample time in CFG2
		/* step 4: config mode */		
		f_SetClearBit((uint32_t*)(ADC0_BASE|0x90),6u,LOW);							// select SW 	// in SC2 register
		f_SetClearBit((uint32_t*)(ADC0_BASE|0x94),3u,HIGH);						// in SC3 register
		/* step 5: config channel and start */
		f_SetMultiBit((uint32_t*)(ADC0_BASE|0),0u,channel_num,0x3F);			// select SC1 channel num to input Analog
	}																			
	else{																							// ADC1
		// config clock for timer select SIRCDIV2
		f_SetMultiBit((uint32_t*)(SCG_BASE|0x204),8u,0x1,MASK_3BIT);			// set SIRDCDIV2_CLK div1 equal 8Mhz

		/* step 1: setting PCC */
		f_SetMultiBit((uint32_t*)(PCC_BASE|0x9C),24u,0x2,MASK_3BIT);			// use SIRCDIV2_CLK
		f_SetClearBit((uint32_t*)(PCC_BASE|0x9C),30u,HIGH);						// enable clock
		/* step 2: config ADC clock */		// in CFG1 register
		f_SetMultiBit((uint32_t*)(ADC1_BASE|0x40),0u,0x0,MASK_2BIT);			// input ALTCLK_1
		f_SetMultiBit((uint32_t*)(ADC1_BASE|0x40),5u,0x0,MASK_2BIT);			// CLK divide select
		/* step 3: config scale */			
		f_SetMultiBit((uint32_t*)(ADC1_BASE|0x40),2u,resolution,MASK_2BIT);	// set resolution
		f_SetMultiBit((uint32_t*)(ADC1_BASE|0x44),0u,13u-1u,MASK_3BIT);		// set sample time in CFG2
		/* step 4: config mode */		
		f_SetClearBit((uint32_t*)(ADC1_BASE|0x90),6u,LOW);							// select SW 	// in SC2 register
		f_SetClearBit((uint32_t*)(ADC1_BASE|0x94),3u,LOW);							// in SC3 register
		/* step 5: config channel and start */
		f_SetMultiBit((uint32_t*)(ADC1_BASE|0),0u,channel_num,0x3F);			// select channel num to input Analog
	}
}

/* note code in main with ADC peripheral*/
//		if(!g_state) f_OffRedLed();
//		else			 f_OnRedLed(); 
//		if(g_ADCvalue>4095/2) f_OnRedLed();
//		else 						 f_OffRedLed();
//		uint32_t volatile flag_COCO = ((*(uint32_t*)(ADC0_BASE|0x00))&(1<<7));			// flag COCO in SC1
//		while(!flag_COCO);											// wait to flag COCO completed	
//		g_ADCvalue = (*((uint32_t*)(ADC0_BASE|0x48))); 		// read value in SE12
		
/* --------------------------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
			function set up SPI0
**********************************************************/
void f_InitSPI0(void){		// use as master
	uint32_t Reg_TCR = 0;										// TCR
	
	uint32_t* PTB2 = (uint32_t*)(PORTB_BASE|2*4);		// SCK
	uint32_t* PTB3 = (uint32_t*)(PORTB_BASE|3*4);		// SIN
	uint32_t* PTB1 = (uint32_t*)(PORTB_BASE|1*4);		// SOUT
	uint32_t* PTB0 = (uint32_t*)(PORTB_BASE|0*4);		// PCS0
	/* set select PIN - port */
	f_SetClearBit(&PCC->mPORTB,30u,HIGH);					// enable clock port
	
	f_SetMultiBit(PTB2,8u,0x3, MASK_3BIT);
	f_SetMultiBit(PTB3,8u,0x3, MASK_3BIT);
	f_SetMultiBit(PTB1,8u,0x3, MASK_3BIT);
	f_SetMultiBit(PTB0,8u,0x3, MASK_3BIT);
	
	/* set PCC for SPI */
	f_SetMultiBit(&PCC->mLPSPI0,24u,0x3,MASK_3BIT);	   // select FIRCDIV2 48Mhz
	f_SetClearBit(&PCC->mLPSPI0,30u,HIGH); 

	
	/* setting clock */
	Reg_TCR |= 0x3<<27;											// prescale div 8
	f_SetMultiBit(&LPSPI0->CCR,0u,0x4,0xf);				// SCK div 4 + 2
//	Reg_TCR |= 0x1<<27;											// prescale div 2
//	f_SetMultiBit(&LPSPI0->CCR,0u,0x3,0xf);				// SCK div 3
	
	/* config pol and phase */
	Reg_TCR |= 0<<31;												// cphase
	Reg_TCR |= 0<<30;												// cpol
	
	/* setting frame data */
	Reg_TCR |= 1<<23;												// LSB first
	Reg_TCR |= 0x7;												// FRAME 8bit

	/* config chip select */
	Reg_TCR |= 0x0<<24;											// PCS0
	
