huhdanu/Device_Driver/Lib/func_s32k1xx.c
	LPSPI0->TCR = Reg_TCR;										// assign value for TCR 
	
	/* setting Tx/Rx FIFO */
	f_SetMultiBit(&LPSPI0->FCR,0u,0u,MASK_2BIT);			// 1 byte TX
	f_SetMultiBit(&LPSPI0->FCR,16u,0u,MASK_2BIT);		// 0 byte RX
	f_SetClearBit(&LPSPI0->CFGR1,3u,HIGH);					// NOSTALL

	/* config LPSPI mode */
	f_SetClearBit(&LPSPI0->CFGR1,0u,HIGH);					// as master
	f_SetClearBit(&LPSPI0->CR,3u,HIGH);						// enable debugging

	/* enable module SPI */
	f_SetClearBit(&LPSPI0->CR,0u,HIGH);			

}
/* --------------------------------------------------------------------------------------------------------------- */



/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
			function set up SPI1
**********************************************************/
void f_InitSPI1(void){		// use as slave
	uint32_t Reg_TCR1 = 0;										// TCR register
	
	uint32_t* PTB14= (uint32_t*)(PORTB_BASE|14*4);		// SCK	
	uint32_t* PTB15 = (uint32_t*)(PORTB_BASE|15*4);		// SIN
	uint32_t* PTB16 = (uint32_t*)(PORTB_BASE|16*4);		// SOUT
	uint32_t* PTB17 = (uint32_t*)(PORTB_BASE|17*4);		// PCS3
	/* set select PIN - port */
	f_SetClearBit(&PCC->mPORTD,30u,HIGH);
	
	f_SetMultiBit(PTB14,8u,0x3, MASK_3BIT);
	f_SetMultiBit(PTB15,8u,0x3, MASK_3BIT);
	f_SetMultiBit(PTB16,8u,0x3, MASK_3BIT);
	f_SetMultiBit(PTB17,8u,0x3, MASK_3BIT);
	
	/* set PCC for SPI */
	f_SetMultiBit(&PCC->mLPSPI1,24u,0x3,MASK_3BIT);	// select FIRCDIV2 48Mhz
	f_SetClearBit(&PCC->mLPSPI1,30u,HIGH);

	
	/* setting clock */
	Reg_TCR1 |= 0x3<<27;											// prescale div 8
	f_SetMultiBit(&LPSPI1->CCR,0u,0x4,0xf);				// SCK div 4 + 2
	
	/* config pol and phase */
	Reg_TCR1 |= 0<<31;				// cphase
	Reg_TCR1 |= 0<<30;				// cpol
	
	/* setting frame data */
	Reg_TCR1 |= 1<<23;
	Reg_TCR1 |= 0x7;

	/* config chip select */
	Reg_TCR1 |= 0x3<<24;										// PCS0
	
	LPSPI1->TCR = Reg_TCR1;

	/* enable receive interrupt */
	f_SetClearBit(&LPSPI1->IER,1u,HIGH);

	/* setting Tx/Rx FIFO */
	f_SetMultiBit(&LPSPI1->FCR,0u,0u,MASK_2BIT);			// 0 byte TX
	f_SetMultiBit(&LPSPI1->FCR,16u,0u,MASK_2BIT);		// 0 byte RX
	f_SetClearBit(&LPSPI1->CFGR1,3u,HIGH);					// NOTSTALL

	/* config LPSPI mode */
	f_SetClearBit(&LPSPI1->CFGR1,0u,LOW);					// as slave
	f_SetClearBit(&LPSPI1->CR,3u,HIGH);						// enable debugging

	/* enable module SPI */
	f_SetClearBit(&LPSPI1->CR,0u,HIGH);			
}
/* --------------------------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
			function set up SPI for IC MAX7219
**********************************************************/
void f_InitSPI_max7219(void){		// use as master
	uint32_t Reg_TCR = 0;										// TCR register
	
	uint32_t* PTB2 = (uint32_t*)(PORTB_BASE|2*4);		// SCK
	uint32_t* PTB3 = (uint32_t*)(PORTB_BASE|3*4);		// SIN
	uint32_t* PTB1 = (uint32_t*)(PORTB_BASE|1*4);		// SOUT
	uint32_t* PTB0 = (uint32_t*)(PORTB_BASE|0*4);		// PCS0
	/* set select PIN - port */
	f_SetClearBit(&PCC->mPORTB,30u,HIGH);					// enable clock port
	f_SetMultiBit(PTB2,8u,0x3, MASK_3BIT);
	f_SetMultiBit(PTB3,8u,0x3, MASK_3BIT);
	f_SetMultiBit(PTB1,8u,0x3, MASK_3BIT);
	f_SetMultiBit(PTB0,8u,0x3, MASK_3BIT);
	
	/* set PCC for SPI */
	f_SetMultiBit(&PCC->mLPSPI0,24u,0x3,MASK_3BIT);		// select FIRCDIV2 48Mhz
	f_SetClearBit(&PCC->mLPSPI0,30u,HIGH);

	
	/* setting clock */
	Reg_TCR |= 0x1<<27;											// prescale div 2
	f_SetMultiBit(&LPSPI0->CCR,0u,1u,0xf);					// SCK div 1 + 2
	
	/* config pol and phase */
	Reg_TCR |= 0<<31;												// cphase
	Reg_TCR |= 0<<30;												// cpol
	
	/* setting frame data */
	Reg_TCR |= 0<<23;												// MSB first
	Reg_TCR |= 0xE;												// FRAME 16bit

	/* config chip select */
	Reg_TCR |= 0x0<<24;											// PCS0
	
	LPSPI0->TCR = Reg_TCR;										// assign value for TCR 
	
	/* setting Tx/Rx FIFO */
	f_SetMultiBit(&LPSPI0->FCR,0u,0u,MASK_2BIT);			// 0 byte TX
	f_SetMultiBit(&LPSPI0->FCR,16u,0u,MASK_2BIT);		// 0 byte RX
	f_SetClearBit(&LPSPI0->CFGR1,3u,HIGH);					// NOSTALL

	/* config LPSPI mode */
	f_SetClearBit(&LPSPI0->CFGR1,0u,HIGH);					// as masterW
	f_SetClearBit(&LPSPI0->CR,3u,HIGH);						// enable debugging

	/* enable module SPI */
	f_SetClearBit(&LPSPI0->CR,0u,HIGH);			

}
/* --------------------------------------------------------------------------------------------------------------- */


/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
			start up for IC MAX7219
**********************************************************/
void f_SetupMAX7219(void){								// use SPI0 
	// decoder MODE all led
	f_DigitalWrite(PORTB,PIN0,LOW);					// chip select
	f_SentMAX7219(0x09FF);								// address
	f_DigitalWrite(PORTB,PIN0,HIGH);

	//brightness setting
	f_DigitalWrite(PORTB,PIN0,LOW);
	f_SentMAX7219(0x0A04);							// 9/32	
	f_DigitalWrite(PORTB,PIN0,HIGH);

	// scan limit
	f_DigitalWrite(PORTB,PIN0,LOW);
	f_SentMAX7219(0x0B07);							// all led	
	f_DigitalWrite(PORTB,PIN0,HIGH);

	// display test
	f_DigitalWrite(PORTB,PIN0,LOW);
	f_SentMAX7219(0x0F00);							// normal
	f_DigitalWrite(PORTB,PIN0,HIGH);
	
	// shutdown MODE
	f_DigitalWrite(PORTB,PIN0,LOW);
	f_SentMAX7219(0x0C01);							// on led
	f_DigitalWrite(PORTB,PIN0,HIGH);
	
}
/* --------------------------------------------------------------------------------------------------------------- */










/* --------------------------------------------------------------------------------------------------------------- */
/********************* STEP TO FOLLOW ********************* 
			string to save value
			enter ADC value
			enter value max of Vref
**********************************************************/
//void f_ProcessADC(char* g_String,uint32_t ADCValue, uint8_t Vref){
//	uint32_t VolValue = ((float)ADCValue/0xFFF)*100*Vref;					// 5V Vref
//	
//	g_String[0] = 48 + (char)(VolValue/100);					
//	g_String[1] = '.';
//	g_String[2] = 48 + (char)(VolValue%100/10);				
//	g_String[3] = 48 + (char)(VolValue%10);
//	g_String[4] = 0x20; 		// space
//	g_String[5] = 'V';
//	g_String[6] = '\n';
//	g_String[7] = '\0';		// end string
//}
/* --------------------------------------------------------------------------------------------------------------- */




	
	/* if(!g_type){									// type 24h
		g_Time[0] = '0' + (g_hour/10);
		g_Time[1] = '0' + (g_hour%10);
		g_Time[2] = ':';
		g_Time[3] = '0' + (g_minute/10);
		g_Time[4] = '0' + (g_minute%10);
		g_Time[5] = ':';
		g_Time[6] = '0' + (g_second/10);
		g_Time[7] = '0' + (g_second%10);
		g_Time[8] = '\n';
		g_Time[9] = '\0';							// end string 
	}	
	else{ 											// type 12h
		if(g_hour>=12){
			g_Time[9] = 'P';						// set 'P' for "PM"
			if(g_hour>12){
				g_Time[0] = '0' + ((g_hour%12)/10);
				g_Time[1] = '0' + ((g_hour%12)%10);
			}
			else{
				g_Time[0] = '0' + ((g_hour)/10);
				g_Time[1] = '0' + ((g_hour)%10);
			}
		}
		else{	
			g_Time[9] = 'A';						// set 'A' for "AM"
			g_Time[0] = '0' + ((g_hour%12)/10);
			g_Time[1] = '0' + ((g_hour%12)%10);
		}	
		g_Time[2] = ':';
		g_Time[3] = '0' + (g_minute/10);
		g_Time[4] = '0' + (g_minute%10);
		g_Time[5] = ':';
		g_Time[6] = '0' + (g_second/10);
		g_Time[7] = '0' + (g_second%10);
		g_Time[8]= 0x20;							// space symbol
		g_Time[10] = 'M';
		g_Time[11]= '\n';
	} */
//}

